<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class NewscontentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        DB::table("newscontents")->insert([
            [
                "catid" => '1',
                "newstitle" => 'هوش مصنوعی حقیقت‌سنج متا به کمک ویکی‌پدیا می‌آید',
                "summery"=>"متا مدل جدیدی از هوش مصنوعی را معرفی کرد که محققان ادعا می‌کنند می‌تواند به دقیق‌تر کردن نوشته‌های ویکی‌پدیا کمک کند.  ",
                "fullcontent"=>"متا مدل جدیدی از هوش مصنوعی را معرفی کرد که محققان ادعا می‌کنند می‌تواند به دقیق‌تر کردن نوشته‌های ویکی‌پدیا کمک کند. این سیستم اطلاعات خود را از 134 میلیون صفحه عمومی جمع‌آوری می‌کند.",
                "updated_at" =>now(),
                "created_at"=>now()
            ],
            [
                "catid" => '9',
                "newstitle" => 'آیین نکوداشت دانش‌آموختگان بین‌المللی برگزار می‌شود',
                "summery"=>'آیین نکوداشت دانش‌آموختگان بین‌المللی سراسر کشور از فردا 21 تیر ماه در مشهد مقدس آغاز می‌شود. ',
                "fullcontent"=>"به گزارش گروه دانشگاه خبرگزاری فارس به نقل از روابط عمومی سازمان امور دانشجویان، آیین نکوداشت دانش‌آموختگان بین‌المللی سراسر کشور با هدف عمق بخشی در ارتباطات فرهنگی ملل در بستر فرهنگ غنی ایران اسلامی، تعمیق ارتباطات عاطفی،  تقویت و استمرار بخشی به ارتباطات دانش‌آموختگان، در شهر مشهد همزمان با دهه امامت و ولایت و در کنار مضجع شریف علی ابن موسی الرضا «ع» و به همت اداره کل دانشجوان بین‌الملل سازمان امور دانشجویان و به میزبانی دانشگاه متا مدل جدیدی از هوش مصنوعی را معرفی کرد که محققان ادعا می‌کنند می‌تواند به دقیق‌تر کردن نوشته‌های ویکی‌پدیا کمک کند. این سیستم اطلاعات خود را از 134 میلیون صفحه عمومی جمع‌آوری می‌کند.فردوسی مشهد برگزار می‌شود.",
                "updated_at" =>now(),
                "created_at"=>now()
            ],
            [
                "catid" => '10',
                "newstitle" => 'واکنش تند برانکو نسبت به جانشینی اسکوچیچ ',
                "summery"=>"برانکو ایووانکوویچ نسبت به شایعات احتمال حضور او روی نیمکت تیم ملی کشورمان واکنش نشان داد.",
                "fullcontent"=>"به گزارش خبرگزاری فارس، برانکو ایوانکوویچ در خصوص جانشینی احتمالی برای اسکوچیچ در تیم ملی ایران اظهار داشت: من احساس شرمندگی می‌کنم. خبرنگاران ایرانی مدام در طول روز به من زنگ می‌زننند. خیلی لحظه ناراحت کننده‌ای است که مرا در این موضعی قرار می‌دهند چون واقعا برای اسکوچیچ ناراحت می‌شوم.",
                "updated_at" =>now(),
                "created_at"=>now()
            ],           
        ]);
    }
}
